Revit 2027 API
FabricationConnectorInfo Methods
The FabricationConnectorInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasDoubleWallConnector |  Checks if there are any double wall connectors fabricated.
IsValid |  Checks if the connector has fabrication parameters associated with it that can be set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace